# identity-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/identity_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=805j8tbaxe]
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.lambda_role: Refreshing state... [id=le-identity_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=a27f5636-438f-4b19-b110-9d75fb1c2982:identity_api]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=production]
module.common_resources.data.curl.cognito_user_pool_keys: Reading...
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/identity_api]
module.common_resources.data.curl.cognito_user_pool_keys: Read complete after 0s [id=1685067533]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-identity_api-20230526003408080600000001]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-b8487336-854b-451c-8fc9-94888c7b9920]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-f9f7c577-70dc-48cf-b92a-8e78f4e7ba53]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 2s [id=f2948755f4745161dd0d2c41e6b02d91dadffea4]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=identity_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=nqe30cp]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any["all"]: Refreshing state... [id=fnso7nu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "identity_api"
        tags                           = {
            "domain"        = "identity"
            "environment"   = "production"
            "resource"      = "identity-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS"                           = "growing-manatee-9600-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"                                 = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"                                  = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"                                    = "0530d124acdb4f93827d8c855a8495d8"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"                              = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"                                    = "Z3Jvd2luZy1tYW5hdGVlLTk2MDAkV03Y9Mt_Nt3bGXzoyjKDvNOcBz3mi9198U0"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"                                 = (sensitive value)
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_DEFAULT_KEYS"             = jsonencode(
                    {
                      - keys = [
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "gJpiqEHp4qIWT6m+zFPeTVvatIu3DQGh3HRPXh7GmyM="
                              - kty = "RSA"
                              - n   = "vc8A2Kh60qtG3Ma7412lPk5d3PtVAUApOuoJBMVq6pNu2M1b0q0l8m6OdxOJaEzylEHPSDJutNid4yDpHWdCT-9M4woj3GvuYUW2Sd25o9Vw-q6jjm5iJ7TeTZ2cs_XlpZq43K7Ns6Vrk9ObuEYkWYXoUxLJMkWZg4ImtJapNAcn2rwjDnRyWddd4seIupWLw6veq4oMCPZ6-RCsWCr_DNTFBGTjZ0TlGlFB6wmyHXkzK0tqDGrSc4pvFWbA6wvcagkYDRFg-OInhaTN8L187kgxodxQkKqh2z_Sud2UbUuIUiGQsjrKSqWVZejwJvkb4-aWDZuOASvpk0ocRaRHrQ"
                              - use = "sig"
                            },
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "14VQrHQLnhETtyoaDaQwP7LEI/OJMOGyTMqF+EYnZzQ="
                              - kty = "RSA"
                              - n   = "pbEPcHhplvt3aOho0USpGkk26Yue6eFV_Lf4n4yo_k_r_fT2wefXEeNBU9t0DpQj-PtzRhDgfyqqdrgeNh3bCNEh-Nxif5xHK2vp9JIqTF7Bvr-gwujLVOuY0nod6acsKMKm-IVeK-bZeV-3Uo1WigiAVPtIIfDRpjXEyrlFGv_XYAP-WJr4DhVSN5Jo07lbKhUYY3v0EpHYl3ettq-9C8aecUCB14iez-mJS00r_DleJ3Yjk66pARkRVg1P8HP8Gc0HGmPUqFAivUzdbCJSQZMiP1DD1tDlLXjM-_HspP8RU_YUSRhshg32bvaHcisj9cLCp9lxYHxpiSZjNYotWQ"
                              - use = "sig"
                            },
                        ]
                    }
                )
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_DEFAULT_REFRESH_RSA_KEYS" = "false"
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_URL"                      = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_taRw3qKmI/.well-known/jwks.json"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "identity"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "identity_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "a27f5636-438f-4b19-b110-9d75fb1c2982:identity_api"
        name       = "identity_api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "3868ccf8-1021-4e96-9848-749c132f9177" -> "a2722855-ca12-4a77-9749-f3391f136672"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*